system.org
#+TITLE: Masamune
#+STARTUP: overview
#+HTML_HEAD_EXTRA: <link rel="stylesheet" type="text/css" href="finishing-touches.css"/>

* Introduction

Read [[./arsttep.html][this]]

* Installing

** Known configurations

#+BEGIN_SRC common-lisp
(defvar known-configurations
  ("Compaq Presario CQ57" (:x11-drivers '("x11-drivers/xf86-video-intel") :make-conf "VIDEO_CARDS=\"intel\""))
  ("Dell Precision M4400" nil))
#+END_SRC

** Install process 

Install funtoo linux using [[http://www.funtoo.org/Funtoo_Linux_Installation ][Funtoo install guide]] with modifications to the following sections:

*Live CD*

You want to use [[http://www.sysresccd.org/Sysresccd-manual-en_How_to_install_SystemRescueCd_on_an_USB-stick][systemrescueCD]] to install funtoo. The "script in the root of the CD-rom" doesn't work. Run =bash ./usb_inst.sh --help= and then each step individually.

When you start system rescue CD, I recommend using the standard 64bit graphical environment.

If you need to use colemak, dvorak =setxkbmap us -variant colemak -option ctrl:nocaps=

*Stage 3 tarball*

Use the latest funtoo-stable stage3 tarball for whatever arch fits your bill.

*Configuring your network > Wi-fi*

NetworkManager includes an ncurses gui, which is far more convenient than futzing around with shell commands.

#+BEGIN_SRC bash
emerge networkmanager
rc-update add NetworkManager default
#+END_SRC

Use the above instead of whatever it is they're recommending. =nmtui= launchs the ncurses gui.

*** Post funtoo install

NOTE: If you see a message like "ModemManager[\\d]: <warn> Couldn't find support for device at '[a-zA-Z/0-9]*': not supported by any plugin" you can probably ignore it. Press RET to get a login prompt.

Enable wifi via =nmtui= and run the following

#+BEGIN_SRC bash
emerge git
emerge sbcl
mkdir -p ~/quicklisp/local-projects/
cd ~/quicklisp/local-projects/ && git clone https://github.com/gabriel-laddel/masamune.git
sbcl --load ~/quicklisp/local-projects/masamune/build/cripple-mode-install.lisp
#+END_SRC

Which will run you through the rest of the process.

* FAQ

Q: When the browser starts it also launches several windows corresponding to failed downloads. How can I remove them?

A: M-x download-remove from each one of the windows before killing with stumpwm

* Developers
** code freeze

- SBCL-1.1.18
- emacs-24.4
- Maxima-5.18.1
- conkeror & XULrunner versions described in [[./browser/conkeror.lisp][conkeror.lisp]]
- [[./third-party-elisp/][Third party elisp in amber.]]

Feel free to argue that a different version of XYZ should be used instead. These were chosen because they all build on my boxen today.

** Misc style comments

Special variables are named as in Let over Lambda, 

#+BEGIN_QUOTE
A traditional naming convention in Common lisp is to prefix and postfix the names of special variables with asterisk characters. For example, we might've chosen to name our =temp-special= variable =*temp-special*=. Since this convention is almost like having another namespace for dynamic variables, diminishing their duality with lexical variables, this book does not follow it exactly.

The asterisks are merely convention and, fortunately Common Lisp does not enforce them. Not only can we leave the asterisks off special variable names, but we can add them to lexical variable names. Maybe it is a question of style. Which is the lesser fashion crime: lexical variables with asterisks or special variables without? I tend to think the less verbose of the two. Also, the names of lexical and special variables can be gensyms, a concept that transcends print names on symbols.

So, as mentioned, this book hijacks the usual asterisk convention. Instead of

Asterisked variable names indicate special variables.

This book uses asterisked variable names indicate special variables defined by the standard.

My largest motivation for dropping these variable names earmuffs is simple and subjective: I think they are annoying to type and make code look ugly. I will not go so far as to suggest you od this for your own programs, just mention that I have been leaving off the earmuffs for years and am very content with Common Lisp

Let over Lambda, pg. 74
#+END_QUOTE

** Debugging

I don't really understand how to go about debugging ALGOL programs. This section exists to dump debugging hacks that might not be obvious to a n00b.

=journalctl --no-pager=

http://jvns.ca/blog/2014/04/20/debug-your-programs-like-theyre-closed-source/

* TODOs
** alpha
