system.org
*** TODO automate installation
*** TODO install sbcl to correct location or point emacs to correct sources
*** TODO leverage portage USE to ensure that systemd is not pulled in under any circumstances
*** TODO lock lisp code + clone stable optima / Alexandria combination

I ran into an issue with a combination of optima / alexandria that can be resolved by loading the following commits:

Optima commit: b2b9e325e09f8c9af1abf7dedc3b072e23318a70 
Alexandria commit: b1c6ee0
   
*** TODO ensure slime+swank are loaded from the git repo in ~/quicklisp/local-projects/ in default build
*** TODO unified documentation

The portage USE flag 'doc' will cause circular dependencies by default. Debug?

*** TODO remove all text editors other than emacs/climacs
*** TODO bind debugger in all threads

currently errors get nesed up to sb-kernel:*maximum-error-depth* when I attempt to join an IRC channel from the knowledge map

*** TODO move all data storage into PCLOS

the system =(ql:quickload '(fmarshal fmarshal-test))= can store most types of data - integrate with manardb.

*** TODO introductory lesson
*** TODO state saving and restoration
*** TODO add all pen testing tools
*** TODO NixOS etc. automatically determine drivers something something kernel modules. How?
** beta
*** TODO unify console mode and graphical UNIX

The correct way to address the situation is to:

0. when the user is first dropped into console mode, query as to the keyboard to be used: dvorak, colemak and qwerty

1. ensure that a modern Emacs with SLIME and a CL compiler are available.

2. document in some fashion (probably info pages) all of the things that you can possibly do in this mode.

3. when the user is dropped into cripple mode for some reason, list all possible commands and promt them to assign them to keys and show them where the documentation describing cripple mode is while within emacs.

#+BEGIN_SRC elisp

(defun cripple-mode-console-colemak ()
  "XXX probably only works on my machine"
  (interactive)
  (save-window-excursion 
    (find-file "/tmp/caps-to-control.map")
    (with-current-buffer "caps-to-control.map"
      (erase-buffer)
      (insert 
       "keycode 58 = Control\n"
       "alt_is_meta\n"
       (shell-command-to-string "dumpkeys | head -1"))
       (save-buffer)))
  (shell-command-to-string "loadkeys /usr/share/keymaps/i386/colemak/en-latin9.map.gz")
  (shell-command-to-string "loadkeys /tmp/caps-to-control.map"))

#+END_SRC

*** TODO review common lisp style guides and codify
*** TODO unified kill ring
*** TODO 'unwind' maxima and move to asdf + quicklisp 
*** TODO improve plotting facilities
*** TODO commission sexp printer, reader for haskell's Language.C.AST
*** TODO translate dependency plotting to CL

http://code.google.com/p/yjl/source/browse/Miscellaneous/PDepGraph.py
http://yjl.googlecode.com/hg/Miscellaneous/PDepGraph.py

*** TODO advice system

- translate advice.el
- http://www.lispworks.com/documentation/lw445/LWRM/html/lwref-268.htm
- http://www.cs.cmu.edu/afs/cs/project/clisp/hackers/phg/clim/src/utils/clos-patches.lisp

** gamma
*** TODO pdf OCR

All the citations must be clickable, and when you click on them, they open up the linked paper, or tell you where it is located (i.e. behind a paywall). I don't want plaintext output, but rather a better format with thef exact same formatting as the original pdf that allows me to click, drag-and-drop and add new content. The authors etc should all be programmatically accessible "new content" should be anything I wish - 3D etc. all the data used to perform the computations should have a "warning - unlinked <location of data, who is responsible for it>" unless a human resolved it to the correct source and bundled it along with the paper

The docview program for Emacs converts .pdfs into .png files for viewing. Use this in 'batch mode' to prep for OCR

