system.html

<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5">TODOs</h2>
<div class="outline-text-2" id="text-5">
</div><div id="outline-container-sec-5-1" class="outline-3">
<h3 id="sec-5-1">alpha</h3>
<div class="outline-text-3" id="text-5-1">
</div><div id="outline-container-sec-5-1-1" class="outline-4">
<h4 id="sec-5-1-1"><span class="todo TODO">TODO</span> automate installation</h4>
</div>
<div id="outline-container-sec-5-1-2" class="outline-4">
<h4 id="sec-5-1-2"><span class="todo TODO">TODO</span> install sbcl to correct location or point emacs to correct sources</h4>
</div>
<div id="outline-container-sec-5-1-3" class="outline-4">
<h4 id="sec-5-1-3"><span class="todo TODO">TODO</span> leverage portage USE to ensure that systemd is not pulled in under any circumstances</h4>
</div>
<div id="outline-container-sec-5-1-4" class="outline-4">
<h4 id="sec-5-1-4"><span class="todo TODO">TODO</span> lock lisp code + clone stable optima / Alexandria combination</h4>
<div class="outline-text-4" id="text-5-1-4">
<p>
I ran into an issue with a combination of optima / alexandria that can be resolved by loading the following commits:
</p>

<p>
Optima commit: b2b9e325e09f8c9af1abf7dedc3b072e23318a70 
Alexandria commit: b1c6ee0
</p>
</div>
</div>

<div id="outline-container-sec-5-1-5" class="outline-4">
<h4 id="sec-5-1-5"><span class="todo TODO">TODO</span> ensure slime+swank are loaded from the git repo in ~/quicklisp/local-projects/ in default build</h4>
</div>
<div id="outline-container-sec-5-1-6" class="outline-4">
<h4 id="sec-5-1-6"><span class="todo TODO">TODO</span> unified documentation</h4>
<div class="outline-text-4" id="text-5-1-6">
<p>
The portage USE flag 'doc' will cause circular dependencies by default. Debug?
</p>
</div>
</div>

<div id="outline-container-sec-5-1-7" class="outline-4">
<h4 id="sec-5-1-7"><span class="todo TODO">TODO</span> remove all text editors other than emacs/climacs</h4>
</div>
<div id="outline-container-sec-5-1-8" class="outline-4">
<h4 id="sec-5-1-8"><span class="todo TODO">TODO</span> bind debugger in all threads</h4>
<div class="outline-text-4" id="text-5-1-8">
<p>
currently errors get nesed up to sb-kernel:*maximum-error-depth* when I attempt to join an IRC channel from the knowledge map
</p>
</div>
</div>

<div id="outline-container-sec-5-1-9" class="outline-4">
<h4 id="sec-5-1-9"><span class="todo TODO">TODO</span> move all data storage into PCLOS</h4>
<div class="outline-text-4" id="text-5-1-9">
<p>
the system <code>(ql:quickload '(fmarshal fmarshal-test))</code> can store most types of data - integrate with manardb.
</p>
</div>
</div>

<div id="outline-container-sec-5-1-10" class="outline-4">
<h4 id="sec-5-1-10"><span class="todo TODO">TODO</span> introductory lesson</h4>
</div>
<div id="outline-container-sec-5-1-11" class="outline-4">
<h4 id="sec-5-1-11"><span class="todo TODO">TODO</span> state saving and restoration</h4>
</div>
<div id="outline-container-sec-5-1-12" class="outline-4">
<h4 id="sec-5-1-12"><span class="todo TODO">TODO</span> add all pen testing tools</h4>
</div>
<div id="outline-container-sec-5-1-13" class="outline-4">
<h4 id="sec-5-1-13"><span class="todo TODO">TODO</span> NixOS etc. automatically determine drivers something something kernel modules. How?</h4>
</div>
</div>
<div id="outline-container-sec-5-2" class="outline-3">
<h3 id="sec-5-2">beta</h3>
<div class="outline-text-3" id="text-5-2">
</div><div id="outline-container-sec-5-2-1" class="outline-4">
<h4 id="sec-5-2-1"><span class="todo TODO">TODO</span> unify console mode and graphical UNIX</h4>
<div class="outline-text-4" id="text-5-2-1">
<p>
The correct way to address the situation is to:
</p>

<ol class="org-ol">
<li>when the user is first dropped into console mode, query as to the keyboard to be used: dvorak, colemak and qwerty
</li>

<li>ensure that a modern Emacs with SLIME and a CL compiler are available.
</li>

<li>document in some fashion (probably info pages) all of the things that you can possibly do in this mode.
</li>

<li>when the user is dropped into cripple mode for some reason, list all possible commands and promt them to assign them to keys and show them where the documentation describing cripple mode is while within emacs.
</li>
</ol>

<div class="org-src-container">

<pre class="src src-elisp">(defun cripple-mode-console-colemak ()
  "XXX probably only works on my machine"
  (interactive)
  (save-window-excursion 
    (find-file "/tmp/caps-to-control.map")
    (with-current-buffer "caps-to-control.map"
      (erase-buffer)
      (insert 
       "keycode 58 = Control\n"
       "alt_is_meta\n"
       (shell-command-to-string "dumpkeys | head -1"))
       (save-buffer)))
  (shell-command-to-string "loadkeys /usr/share/keymaps/i386/colemak/en-latin9.map.gz")
  (shell-command-to-string "loadkeys /tmp/caps-to-control.map"))
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-5-2-2" class="outline-4">
<h4 id="sec-5-2-2"><span class="todo TODO">TODO</span> review common lisp style guides and codify</h4>
</div>
<div id="outline-container-sec-5-2-3" class="outline-4">
<h4 id="sec-5-2-3"><span class="todo TODO">TODO</span> unified kill ring</h4>
</div>
<div id="outline-container-sec-5-2-4" class="outline-4">
<h4 id="sec-5-2-4"><span class="todo TODO">TODO</span> 'unwind' maxima and move to asdf + quicklisp</h4>
</div>
<div id="outline-container-sec-5-2-5" class="outline-4">
<h4 id="sec-5-2-5"><span class="todo TODO">TODO</span> improve plotting facilities</h4>
</div>
<div id="outline-container-sec-5-2-6" class="outline-4">
<h4 id="sec-5-2-6"><span class="todo TODO">TODO</span> commission sexp printer, reader for haskell's Language.C.AST</h4>
</div>
<div id="outline-container-sec-5-2-7" class="outline-4">
<h4 id="sec-5-2-7"><span class="todo TODO">TODO</span> translate dependency plotting to CL</h4>
<div class="outline-text-4" id="text-5-2-7">
<p>
<a href="http://code.google.com/p/yjl/source/browse/Miscellaneous/PDepGraph.py">http://code.google.com/p/yjl/source/browse/Miscellaneous/PDepGraph.py</a>
<a href="http://yjl.googlecode.com/hg/Miscellaneous/PDepGraph.py">http://yjl.googlecode.com/hg/Miscellaneous/PDepGraph.py</a>
</p>
</div>
</div>

<div id="outline-container-sec-5-2-8" class="outline-4">
<h4 id="sec-5-2-8"><span class="todo TODO">TODO</span> advice system</h4>
<div class="outline-text-4" id="text-5-2-8">
<ul class="org-ul">
<li>translate advice.el
</li>
<li><a href="http://www.lispworks.com/documentation/lw445/LWRM/html/lwref-268.htm">http://www.lispworks.com/documentation/lw445/LWRM/html/lwref-268.htm</a>
</li>
<li><a href="http://www.cs.cmu.edu/afs/cs/project/clisp/hackers/phg/clim/src/utils/clos-patches.lisp">http://www.cs.cmu.edu/afs/cs/project/clisp/hackers/phg/clim/src/utils/clos-patches.lisp</a>
</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-sec-5-3" class="outline-3">
<h3 id="sec-5-3">gamma</h3>
<div class="outline-text-3" id="text-5-3">
</div><div id="outline-container-sec-5-3-1" class="outline-4">
<h4 id="sec-5-3-1"><span class="todo TODO">TODO</span> pdf OCR</h4>
<div class="outline-text-4" id="text-5-3-1">
<p>
All the citations must be clickable, and when you click on them, they open up the linked paper, or tell you where it is located (i.e. behind a paywall). I don't want plaintext output, but rather a better format with thef exact same formatting as the original pdf that allows me to click, drag-and-drop and add new content. The authors etc should all be programmatically accessible "new content" should be anything I wish - 3D etc. all the data used to perform the computations should have a "warning - unlinked &lt;location of data, who is responsible for it&gt;" unless a human resolved it to the correct source and bundled it along with the paper
</p>

<p>
The docview program for Emacs converts .pdfs into .png files for viewing. Use this in 'batch mode' to prep for OCR
</p>
</div>
</div>
