system.org
*** TODO cut all dependencies on portage / funtoo
**** TODO usb stick install for all platforms + trivial build from any machine running masamune
**** TODO unify compression format
    
Portage uses several compression format. Identify a /single/ compression format that will work for all code packages & documentation and use that instead.

*** TODO lispy audio

#+BEGIN_SRC
# for emacspeaks

flite -voice kal16 -t testing
#+END_SRC

review the following codebases

- pocket sphinx
- sphinx2
- sphinx3
- sphinxbase
- cl-pulseaudio

*** TODO common lisp only editor

see https://github.com/capitaomorte/sly for a rethinking of SLIME+SWANK. In the
new Lisp editor there are a few things that are needed out of the box we don't
have today in anything else.  persistant, cl-ppcre searchable rings, slime eval,
eval in frame etc. that (possibly) specializes on the place in the 'global-tree'
of such things.

- when I change the name of a function or its arglist, register a pending request to update all of the calls to the function.

- keep track of all undefined functions etc. within the program even after an individual sexpr is compiled

- keep track of "" matching within and nested strings?

- with-open-file autocompletion (ie, just give me a stream name and complete symbols - can other forms use type inference to determine intermediate symbol names? I generally don't care much what they're called)

- full english / todo editing integrated into the comments

- index all codebases loaded into the lisp image for commands like `who-calls'

- detect invalid lambda-lists

- testing out of the box + stats on what is untested & tested

- apropos (cl-ppcre regex)

- smart updates of packages and .asd files according to your exports at the repl

- better autodocs

- autocompletion everywhere that works across packages (ie, pathnames, names should complete in both repl and buffers)

- structure editing /only/

- multiple repls

- repl into other boxes out of the box

- better inspector - if I've a image / video / audio on one of my objects I should be able to see it

- renaming files should update the .asd and also take care of any documentation references.

- smart renaming mechanisms, smart argument list changes- notify me what else needs to be updated when I update a function -- this should carry through to the documentation of the codebase

- 'flavors' of asdf-compiling a system, that is, "fast" "debuggable"

**** TODO removing Emacs

Emacs is currently kept around to perform the following tasks

- reading info files

- reading pdfs
    
- Magit
 
At some point in time someone sane will get fed up with git and write a CL-aware alternative, but until then we're stuck with Magit. Or we could just ditch git which performs a /very/ basic task and is a massive pos.

*** TODO removing X

relevent codebases,

https://github.com/pyb/zen
http://www.cliki.net/CLX-CURSOR
http://www.cliki.net/CLX-TRUETYPE
http://xcb.freedesktop.org/XmlXcb/
[[http://www.cliki.net/Acclaim][drawings directly on the screen using CLX]]
http://www.cliki.net/CL-VECTORS
[[http://users.actrix.co.nz/mycroft/event.lisp][CLX events]]
[[http://common-lisp.net/project/cmucl/doc/clx/][CLX manual]]
[[http://www.cawtech.demon.co.uk/clx/simple/examples.html][tutorial of using CLX]]
[[https://github.com/filonenko-mikhail/clx-xkeyboard][If we could get rid of the X keyboard system entirely that would be great.]]

*** TODO adopt all good ideas from related technologies
**** ankisrs.net
***** pros
***** cons
**** Knewton
***** pros
***** cons

Their product is currently not (and will never be?) open to the public. Thus it has no future.

**** Khan Academy
***** pros   
