system.html

<div id="outline-container-sec-5-3-3" class="outline-4">
<h4 id="sec-5-3-3"><span class="todo TODO">TODO</span> cut all dependencies on portage / funtoo</h4>
<div class="outline-text-4" id="text-5-3-3">
</div><ul class="org-ul"><li><a id="sec-5-3-3-1" name="sec-5-3-3-1"></a><span class="todo TODO">TODO</span> usb stick install for all platforms + trivial build from any machine running masamune<br  /></li>
<li><a id="sec-5-3-3-2" name="sec-5-3-3-2"></a><span class="todo TODO">TODO</span> unify compression format<br  /><div class="outline-text-5" id="text-5-3-3-2">
<p>
Portage uses several compression format. Identify a <i>single</i> compression format that will work for all code packages &amp; documentation and use that instead.
</p>
</div>
</li></ul>
</div>

<div id="outline-container-sec-5-3-4" class="outline-4">
<h4 id="sec-5-3-4"><span class="todo TODO">TODO</span> lispy audio</h4>
<div class="outline-text-4" id="text-5-3-4">
<pre class="example">
# for emacspeaks

flite -voice kal16 -t testing
</pre>

<p>
review the following codebases
</p>

<ul class="org-ul">
<li>pocket sphinx
</li>
<li>sphinx2
</li>
<li>sphinx3
</li>
<li>sphinxbase
</li>
<li>cl-pulseaudio
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-5-3-5" class="outline-4">
<h4 id="sec-5-3-5"><span class="todo TODO">TODO</span> common lisp only editor</h4>
<div class="outline-text-4" id="text-5-3-5">
<p>
see <a href="https://github.com/capitaomorte/sly">https://github.com/capitaomorte/sly</a> for a rethinking of SLIME+SWANK. In the
new Lisp editor there are a few things that are needed out of the box we don't
have today in anything else.  persistant, cl-ppcre searchable rings, slime eval,
eval in frame etc. that (possibly) specializes on the place in the 'global-tree'
of such things.
</p>

<ul class="org-ul">
<li>when I change the name of a function or its arglist, register a pending request to update all of the calls to the function.
</li>

<li>keep track of all undefined functions etc. within the program even after an individual sexpr is compiled
</li>

<li>keep track of "" matching within and nested strings?
</li>

<li>with-open-file autocompletion (ie, just give me a stream name and complete symbols - can other forms use type inference to determine intermediate symbol names? I generally don't care much what they're called)
</li>

<li>full english / todo editing integrated into the comments
</li>

<li>index all codebases loaded into the lisp image for commands like `who-calls'
</li>

<li>detect invalid lambda-lists
</li>

<li>testing out of the box + stats on what is untested &amp; tested
</li>

<li>apropos (cl-ppcre regex)
</li>

<li>smart updates of packages and .asd files according to your exports at the repl
</li>

<li>better autodocs
</li>

<li>autocompletion everywhere that works across packages (ie, pathnames, names should complete in both repl and buffers)
</li>

<li>structure editing <i>only</i>
</li>

<li>multiple repls
</li>

<li>repl into other boxes out of the box
</li>

<li>better inspector - if I've a image / video / audio on one of my objects I should be able to see it
</li>

<li>renaming files should update the .asd and also take care of any documentation references.
</li>

<li>smart renaming mechanisms, smart argument list changes- notify me what else needs to be updated when I update a function &#x2013; this should carry through to the documentation of the codebase
</li>

<li>'flavors' of asdf-compiling a system, that is, "fast" "debuggable"
</li>
</ul>
</div>

<ul class="org-ul"><li><a id="sec-5-3-5-1" name="sec-5-3-5-1"></a><span class="todo TODO">TODO</span> removing Emacs<br  /><div class="outline-text-5" id="text-5-3-5-1">
<p>
Emacs is currently kept around to perform the following tasks
</p>

<ul class="org-ul">
<li>reading info files
</li>

<li>reading pdfs
</li>

<li>Magit
</li>
</ul>

<p>
At some point in time someone sane will get fed up with git and write a CL-aware alternative, but until then we're stuck with Magit. Or we could just ditch git which performs a <i>very</i> basic task and is a massive pos.
</p>
</div>
</li></ul>
</div>

<div id="outline-container-sec-5-3-6" class="outline-4">
<h4 id="sec-5-3-6"><span class="todo TODO">TODO</span> removing X</h4>
<div class="outline-text-4" id="text-5-3-6">
<p>
relevent codebases,
</p>

<p>
<a href="https://github.com/pyb/zen">https://github.com/pyb/zen</a>
<a href="http://www.cliki.net/CLX-CURSOR">http://www.cliki.net/CLX-CURSOR</a>
<a href="http://www.cliki.net/CLX-TRUETYPE">http://www.cliki.net/CLX-TRUETYPE</a>
<a href="http://xcb.freedesktop.org/XmlXcb/">http://xcb.freedesktop.org/XmlXcb/</a>
<a href="http://www.cliki.net/Acclaim">drawings directly on the screen using CLX</a>
<a href="http://www.cliki.net/CL-VECTORS">http://www.cliki.net/CL-VECTORS</a>
<a href="http://users.actrix.co.nz/mycroft/event.lisp">CLX events</a>
<a href="http://common-lisp.net/project/cmucl/doc/clx/">CLX manual</a>
<a href="http://www.cawtech.demon.co.uk/clx/simple/examples.html">tutorial of using CLX</a>
<a href="https://github.com/filonenko-mikhail/clx-xkeyboard">If we could get rid of the X keyboard system entirely that would be great.</a>
</p>
</div>
</div>

<div id="outline-container-sec-5-3-7" class="outline-4">
<h4 id="sec-5-3-7"><span class="todo TODO">TODO</span> adopt all good ideas from related technologies</h4>
<div class="outline-text-4" id="text-5-3-7">
</div><ul class="org-ul"><li><a id="sec-5-3-7-1" name="sec-5-3-7-1"></a>ankisrs.net<br  /><ul class="org-ul"><li><a id="sec-5-3-7-1-1" name="sec-5-3-7-1-1"></a>pros<br  /></li>
<li><a id="sec-5-3-7-1-2" name="sec-5-3-7-1-2"></a>cons<br  /></li></ul>
</li>
<li><a id="sec-5-3-7-2" name="sec-5-3-7-2"></a>Knewton<br  /><ul class="org-ul"><li><a id="sec-5-3-7-2-1" name="sec-5-3-7-2-1"></a>pros<br  /></li>
<li><a id="sec-5-3-7-2-2" name="sec-5-3-7-2-2"></a>cons<br  /><div class="outline-text-6" id="text-5-3-7-2-2">
<p>
Their product is currently not (and will never be?) open to the public. Thus it has no future.
</p>
</div>
</li></ul>
</li>
