system.html

<li><a id="sec-5-3-7-3" name="sec-5-3-7-3"></a>Khan Academy<br  /><ul class="org-ul"><li><a id="sec-5-3-7-3-1" name="sec-5-3-7-3-1"></a>pros<br  /></li>
<li><a id="sec-5-3-7-3-2" name="sec-5-3-7-3-2"></a>cons<br  /><div class="outline-text-6" id="text-5-3-7-3-2">
<ul class="org-ul">
<li>there is far too much going on visually.
</li>

<li>I'm not entirely sold on the idea of hints - generally speaking, you either
understand something, or not. It's not as if seeing a 'hint' (part of the
solution) is going to jump start your brain into understanding. If I don't
understand show exactly how the solution was derived and call it "show
solution". Renaming it to 'hint' is dishonest.
</li>

<li>It's rather irritating that I can't sign up for a course / lesson / path and resume where I left off.
</li>

<li>Not personalized enough - when it knows the language I use and other such settings.
</li>

<li>resource intensive - slow, causes chrome to crash
</li>

<li>The concepts they teach are all relatively sophomoric. 
</li>

<li>doesn't allow for mastery, as in, it's a technology that punishes experts.
</li>

<li>there isn't a clear flow when practicing skills
</li>

<li>Overload of points and notifications / badges, and it's not clear what they represent, or what their value is.
</li>

<li>the community page is far too cluttered
</li>

<li>on the 'mission' page there is far too much going on. You really only need one progress bar.
</li>

<li>Logos suck
</li>

<li>There isn't a GO button, or any clear way to quickly set off from what you were last learning.
</li>

<li>Okay, yes, the UI is friendly, but it's also insulting to my intelligence. Where are my options, settings etc?
</li>

<li>HTML5 back button doesn't work like you would expect
</li>

<li>slow
</li>

<li>Problems should fit on the screen
</li>

<li>I can scroll down when I'm in the middle of solving problems. Irritating, especially since there isn't anything there.
</li>

<li>If I get something correct, automatically move me onto the next problem
</li>

<li>When I get to the end of a task and see the task dashboard, there isn't a 'continue' button. This breaks my flow.
</li>

<li>the graphs / dashboard visualizations don't fit together to form a coherent whole. How much have I learned of the subject, course, mission? I've nfi. What is the purpose of the metrics you're showing me?
</li>

<li>I want an introduction to the concepts used to structure information within their program, but nothing is available. I know what a coach is irl, but no idea what it means on your system.
</li>

<li>it's not clear where to get started if I want to learn something new or spend my time browsing around - probably b/c the concepts are not clearly defined.
</li>
</ul>
</div>
</li></ul>
</li>

<li><a id="sec-5-3-7-4" name="sec-5-3-7-4"></a>clever<br  /><ul class="org-ul"><li><a id="sec-5-3-7-4-1" name="sec-5-3-7-4-1"></a>pros<br  /></li>
<li><a id="sec-5-3-7-4-2" name="sec-5-3-7-4-2"></a>cons<br  /></li></ul>
</li>
<li><a id="sec-5-3-7-5" name="sec-5-3-7-5"></a>EdX<br  /><ul class="org-ul"><li><a id="sec-5-3-7-5-1" name="sec-5-3-7-5-1"></a>pros<br  /></li>
<li><a id="sec-5-3-7-5-2" name="sec-5-3-7-5-2"></a>cons<br  /></li></ul>
</li>
<li><a id="sec-5-3-7-6" name="sec-5-3-7-6"></a>Coursera<br  /><ul class="org-ul"><li><a id="sec-5-3-7-6-1" name="sec-5-3-7-6-1"></a>pros<br  /></li>
<li><a id="sec-5-3-7-6-2" name="sec-5-3-7-6-2"></a>cons<br  /></li></ul>
</li>
<li><a id="sec-5-3-7-7" name="sec-5-3-7-7"></a>brilliant.org<br  /><ul class="org-ul"><li><a id="sec-5-3-7-7-1" name="sec-5-3-7-7-1"></a>pros<br  /></li>
<li><a id="sec-5-3-7-7-2" name="sec-5-3-7-7-2"></a>cons<br  /></li></ul>
</li>
<li><a id="sec-5-3-7-8" name="sec-5-3-7-8"></a>quizlet<br  /><ul class="org-ul"><li><a id="sec-5-3-7-8-1" name="sec-5-3-7-8-1"></a>pros<br  /></li>
<li><a id="sec-5-3-7-8-2" name="sec-5-3-7-8-2"></a>cons<br  /><div class="outline-text-6" id="text-5-3-7-8-2">
<ul class="org-ul">
<li>slow
</li>
</ul>
</div>
</li></ul>
</li></ul>
</div>
</div>
</div>
</div>
</body>
</html>
